ttmp/2026/05/15/GOJA-STRESS-TEST--stress-testing-breakdown-experiments-for-goja-site/archive/pprof-kanban-action-80rps-20260515T151521Z/summary.txt
# goja-site Vegeta benchmark

- Scenario: kanban-action
- Duration: 30s
- Warmup duration: 5s
- Rate: 80/s
- Base URL: http://127.0.0.1:18700
- Metrics URL: http://127.0.0.1:19700/metrics
- pprof capture: 1
- pprof seconds: 20
- OpenTelemetry enabled: 0
- OpenTelemetry endpoint: http://127.0.0.1:4318/v1/traces
- OpenTelemetry sample ratio: 0.01
- Commit: a214bf3c132f29ba3d3080abec4de9f999068595
- Dirty worktree: true
- Go version: go version go1.26.2 linux/amd64
- Vegeta: Version: 

## Report

```text
Requests      [total, rate, throughput]         2400, 80.03, 80.00
Duration      [total, attack, wait]             29.999s, 29.988s, 11.411ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.75ms, 36.297ms, 14.412ms, 138.113ms, 178.339ms, 221.485ms, 251.72ms
Bytes In      [total, mean]                     932940000, 388725.00
Bytes Out     [total, mean]                     120000, 50.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:2400  
Error Set:
```

## Artifacts

- Raw results: vegeta.bin
- JSON report: vegeta.json
- Text report: vegeta.txt
- Run metadata: metadata.json
- Metrics before: metrics-before.prom
- Metrics after: metrics-after.prom
- Metrics delta: metrics-delta.txt
- Server log: server.log
- Targets: targets.txt
- CPU profile: cpu.pprof (when --pprof is set)
- Heap profile: heap.pprof (when --pprof is set)
- Goroutine profile: goroutine.txt (when --pprof is set)